class db:
    db = {
        'rule': ['xx-xx','xxx-xxx-xx','x-xx-x'], # 검증을 위한 규칙
        'pin': {
            '00-11' : {
                'syz':40,
                'yzw':80,
                'xyu':90
            },
            '00-112-33' : {
                'abc':50,
                'def':80,
                'ghi':50
            },
            '00-111-22' : {
                'sdz':40,
                'yww':50,
                'xzu':90
            },
            '00-11-2' : {
                'sdz':20,
                'yww':30,
                'xzu':40
            }
        }
    }

# form = []
# db = {
#     '00-11' : ['syz','syz2','syz3'],
#     '111-222-33':['abc','abc1','abc2'],
#     '3-11-2':['gg1','gg2','gg3']
# }